slides/Project1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Project1</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Project1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-09-24T22:59-0700"/>
<meta name="author" content="Jim Blomo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Project1</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Project: URL shortener</a></li>
<li><a href="#sec-2">2 Project Overview</a></li>
<li><a href="#sec-3">3 Dates</a>
<ul>
<li><a href="#sec-3-1">3.1 Part 1 Details</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Sharing Code</a>
<ul>
<li><a href="#sec-4-1">4.1 Keep In Mind</a></li>
<li><a href="#sec-4-2">4.2 Extra Credit: Adding bitly Features</a></li>
</ul>
</li>
<li><a href="#sec-5">5 <code>app.py</code></a>
<ul>
<li><a href="#sec-5-1">5.1 DB</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Project: URL shortener &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Demo: <a href="http://bitly.com">bitly</a>
</li>
<li>This project is simpler
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Project Overview &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Teams of up to <b>4</b>
</li>
<li>Part 1: Implement select feature set
</li>
<li>Part 2: Get creative! Implement product ideas
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Dates &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>Oct 31st: Part 1 due
</li>
<li>Nov 14th: Optional Part 2 Proposal
</li>
<li>Dec 12th: Technical report due
</li>
<li>Dec 13th: Class presentation
</li>
</ul>



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Part 1 Details &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-3-1">

<ol>
<li>Update <code>templates/home.html</code> to create a form with 2 text fields: the short path, and the long url.
<ol>
<li>Use the <code>label</code> tag to label the text fields.
</li>
<li>Improve the HTML with at least 4 non-form tag types.
</li>
<li>HTML must <a href="http://validator.w3.org/">validate</a>.
</li>
<li>Improve the CSS with at least 4 new selectors.
</li>
<li>Improve the CSS with at least 4 new properties.
</li>
<li>CSS must <a href="http://jigsaw.w3.org/css-validator/">validate</a>.
</li>
<li>Use Javascript to ensure the short path is only letters before the
         submit button can be clicked.
</li>
</ol>

</li>
<li>The form must <code>POST</code> a request to <code>server/shorts</code> to create a new association between the short name and the long url.
</li>
<li><code>server/shorts</code> must return HTML with information about the new association.
</li>
<li>Future attempts to <code>GET</code> <code>server/short/&lt;name&gt;</code> must redirect to the long url.
</li>
<li>Attempts to <code>GET</code> <code>server/short/&lt;name&gt;</code> where &lt;name&gt; has no association must return <code>404 NOT FOUND</code>
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Sharing Code &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>One member create a fork of webarch2013 -&gt; project-webarch
</li>
<li>Add collaborators (incl instructors) to new fork
</li>
<li><code>git clone</code> forked repository to ischool server
</li>
<li>Turn in your homework via personal, project via fork
</li>
</ul>


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Keep In Mind &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>Suggest using same workflow as homework: <code>checkout -b</code> for a new feature,
     issue a pull request, get someone on your team to review, merge into master
</li>
<li>You can only run one <code>server/app.py</code> at a time &ndash; even from different
     directories
</li>
</ul>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Extra Credit: Adding bitly Features &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>Automatically choose short path
</li>
<li>Use the same short path for existing URLs
</li>
<li>Only applies to Part 1
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <code>app.py</code> &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">

<ul>
<li>Comments and docstrings
</li>
<li><code>@app.route</code> associates a path to a representation
</li>
<li><code>request.args.get</code> dictionary to access <code>GET</code> query arguments
</li>
<li><code>render_template</code> will render the file in <code>templates/</code>
</li>
<li><code>make_response</code> is generating an image
</li>
<li><code>/wiki</code> is a semi-working redirector to use in HW
</li>
<li><code>request.form.get</code> is a dictionary to access <code>POST</code> data
</li>
<li><code>db</code> is a dictionary that acts like a database
</li>
<li><code>app.logger.debug</code> will print out variables when requests are made
</li>
<li><code>flask.redirect</code> will send the correct headers and response code. Just give
    it a URL
</li>
<li>compiling errors: restart <code>app.py</code>
</li>
</ul>


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> DB &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>DB will be personalized to you. Collaborators will not be able to edit your
     DB by default.
</li>
</ul>





<script type="text/javascript" src="production/org-html-slideshow.js"></script>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-09-24T22:59-0700</p>
<p class="author">Author: Jim Blomo</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
